[
  {
    "id": "1762197132425",
    "name": "The video presents two separate murder cases investigated...",
    "analysisText": "[Notice] Request received. Processing...\n\n[Notice] Starting analysis...\n[Notice] Queued. Position: 1\nUploading video to Gemini File API…\nUpload complete. Waiting for Gemini to process the file…\nFile is ACTIVE. Starting analysis with Gemini 2.5 Pro…\n\nMETADATA:\n- Date: 2021-10-18, July 3, 2017, May 2021, Feb. 2022, October 18th, 2021, July 2019, 10/19/2021, June 2023, March 1st, 2019, March 2nd, July 11th, July 13th, 2019\n- Address/Location: Baptist Medical Center South, Autauga County Courthouse, 2105 East South Blvd, Elizondo Tower, Nagel's Gun Shop\n- City/State/County: Prattville, Alabama, Autauga County, Montgomery, Alabama; San Antonio, Texas, Bexar County, Portland, Jamaica\n- Police Department: Autauga 911, Prattville Police Department, Bexar County Sheriff's Office\n\nTIMESTAMPS:\n1. 911 CALLS (1)\n- [03:55 - 04:34] - Husband's 911 call - Hunter Tatum calls 911 in a hysterical state, claiming he shot his wife, Summer, after she pulled a gun on him and they struggled over the weapon.\n\n2. CCTV FOOTAGE (4)\n- [10:14 - 11:24] - Neighbor's camera audio - A neighbor's security camera captures the audio of Summer Tatum screaming \"No!\" and \"Please, no!\", followed by Hunter Tatum yelling \"Nope!\" and two gunshots, contradicting his self-defense claim.\n- [19:53 - 21:05] - Suspect's suspicious purchases - CCTV footage from a Lowe's hardware store shows Andre McDonald purchasing a shovel, axe, hatchet, trash bags, and gasoline containers in the middle of the night after his wife went missing.\n- [21:05 - 21:28] - Suspect at gas station - Surveillance footage from a gas station shows Andre McDonald's car at the pumps, which corresponds with the time of a text argument with his wife.\n- [21:30 - 21:49] - Suspect's arrest - CCTV footage from outside a gun shop shows Andre McDonald being apprehended by undercover officers.\n\n3. INTERROGATION (3)\n- [08:41 - 10:14] - Hunter's first interview - Hunter Tatum describes his version of the shooting, claiming he was cheating, his wife found out, she pulled a gun, and it went off during a struggle.\n- [13:53 - 15:24] - Notified of deaths - A detective informs Hunter Tatum that both his wife, Summer, and their newborn baby have died. Hunter breaks down in tears and collapses.\n- [15:24 - 16:19] - Hunter's new charges - After being informed of the deaths, Hunter is seen in his jail jumpsuit and is informed that his charges have been upgraded to two counts of murder. He reacts with disbelief and despair.\n\n4. BODYCAM FOOTAGE (6)\n- [04:50 - 05:29] - Police arrive and arrest - Bodycam footage shows officers arriving, entering the house, and immediately taking a distraught Hunter Tatum into custody.\n- [05:29 - 06:28] - Victim found alive - Officers find Summer Tatum shot in the bedroom but still breathing. They call for medics and try to comfort her. Hunter reveals she is six months pregnant.\n- [07:22 - 08:26] - Crime scene processing - An officer's bodycam shows the state of the home, including a messy bedroom with packed bags and the discovery of an Xbox and games submerged in the kitchen sink.\n- [08:27 - 09:03] - Suspect in police car - Hunter Tatum is placed in the back of a police car, where he is recorded audibly questioning himself, \"Why did you do it?\"\n- [15:02 - 15:23] - Transfer to jail - Bodycam footage shows Hunter Tatum being escorted out of an interview room and into a police car after being charged with murder.\n- [15:24 - 15:51] - Informing suspect of deaths - A detective's bodycam records the moment he tells Hunter Tatum in an interview room that his wife and baby have both passed away, showing Hunter's emotional breakdown.\n\n5. DASHCAM FOOTAGE (1)\n- [04:36 - 04:50] - Police response - Dashcam footage shows a police vehicle responding with lights and sirens to the 911 call from the Tatum residence.\n\n6. INVESTIGATION (6)\n- [01:04 - 01:25] - Case introduction - The investigation begins in Prattville, Alabama, introducing the victim, Summer Tatum.\n- [07:27 - 08:26] - Key evidence discovery - Investigators find the gun on the dining table and a bizarre scene of an Xbox and games covered in a white substance in the kitchen sink, suggesting a heated argument.\n- [11:27 - 12:12] - Autopsy findings - The autopsy report reveals Summer Tatum was shot twice in the back of the head, once with a non-lethal \"rat shot\" and a second, fatal shot. This contradicts the self-defense claim.\n- [19:20 - 20:09] - Search of McDonald home - In the second case, deputies searching Andre McDonald's home find blood on a light switch and door, and evidence of a fire in the backyard.\n- [20:25 - 20:53] - Forensic evidence - The investigation connects a torn receipt found in the trash to Andre McDonald's suspicious purchases at a hardware store.\n- [23:31 - 24:07] - Autopsy of Andreen McDonald - After Andreen's skeletal remains are found, an autopsy confirms she died from homicidal violence, including blunt force trauma, and that some of her finger bones had been burned.\n\nSUMMARY AND STORYLINE:\nThe video presents two separate murder cases investigated with the help of camera footage.\n\nThe first case takes place in Prattville, Alabama, on October 18, 2021. Hunter Tatum calls 911, claiming he shot his pregnant wife, Summer, in self-defense during a struggle over a gun after she discovered he was cheating. Responding officers find Summer critically injured and arrest a hysterical Hunter. While Hunter maintains his story during interrogation, key evidence contradicts his claims. A neighbor's security camera captures audio of Summer screaming for her life, followed by two gunshots, but no sound of a struggle. Bodycam footage reveals the crime scene was chaotic, with packed bags suggesting Summer was trying to leave. An autopsy later confirms Summer was shot twice in the back of the head. Tragically, both Summer and their prematurely delivered baby die from their injuries. Faced with the irrefutable video and forensic evidence, Hunter Tatum was convicted of capital murder and sentenced to 198 years in prison.\n\nThe second case, a preview within the main program, begins in San Antonio, Texas, on March 1, 2019, when successful businesswoman Andreen McDonald is reported missing. Her husband, Air Force Major Andre McDonald, becomes the primary suspect due to his uncooperative behavior. Investigators find blood and evidence of a fire at their home. The crucial evidence comes from CCTV footage showing Andre purchasing a shovel, axe, gasoline, and other suspicious items from a Lowe's store on the night Andreen disappeared. He is arrested, and Andreen's burned, dismembered remains are found on a ranch months later. The investigation reveals the murder was motivated by Andre's anger over Andreen starting a new business without his knowledge. Despite the evidence, a jury acquitted him of murder but found him guilty of manslaughter, sentencing him to 20 years.\n[Notice] File saved to: /shared/1762197129133-lg6jc8.mp4\n\n",
    "videoUrl": "http://localhost:3001/shared/1762197129133-lg6jc8.mp4",
    "fileName": "Killer Cases Docu.mp4",
    "createdAt": 1762197132425,
    "date": "2025-11-03T19:12:12.425Z"
  },
  {
    "id": "1762192877149",
    "name": "This episode of \"Killers Caught on Camera\" presents two s...",
    "analysisText": "[Notice] Request received. Processing...\n\n[Notice] Starting analysis...\n[Notice] Queued. Position: 1\nUploading video to Gemini File API…\nUpload complete. Waiting for Gemini to process the file…\nFile is ACTIVE. Starting analysis with Gemini 2.5 Pro…\n\nMETADATA:\n- Date: 2021-10-18, May 2021, July 2019, Feb. 2022, Oct. 18th 2021, Oct. 19, 2021, March 1st 2019, March 2nd 2019, July 11th 2019, July 13th 2019, June 2023\n- Address/Location: Baptist Medical Center South, Baptist Neighborhood Hospital, Elizondo Tower, Bexar County Courthouse, Nagel's Gun Shop, Lowe's hardware store, Autauga County Courthouse\n- City/State/County: Prattville, Autauga County, Alabama; Montgomery, Alabama; San Antonio, Bexar County, Texas; Portland, Jamaica\n- Police Department: Prattville Police Department, Autauga 911, Bexar County Sheriff's Office, Bexar County District Attorney's Office\n\nTIMESTAMPS:\n\n1. 911 CALLS (1)\n- [03:55 - 04:33] - Distraught 911 Call - Hunter Tatum makes a frantic 911 call to Autauga 911, claiming his wife pulled a gun on him, they wrestled for it, and he shot her.\n\n2. CCTV FOOTAGE (5)\n- [17:41 - 18:24] - Argument Audio - A neighbor's security camera captures the audio of Hunter and Summer Tatum arguing just before the shooting.\n- [20:57 - 21:46] - Pleading and Gunshots - Audio from a neighbor's security camera captures Summer Tatum screaming \"No! Please, no!\" followed by two distinct gunshots.\n- [32:12 - 32:56] - Hospital Visit - Andre McDonald is seen on CCTV entering a Baptist Neighborhood Hospital, speaking briefly with the receptionist, and then quickly leaving without investigating further.\n- [34:31 - 34:40] - Suspect Arrested - CCTV footage from outside a gun store shows undercover officers moving in to arrest Andre McDonald in the parking lot.\n- [36:36 - 36:53] - Suspicious Purchases - Andre McDonald is seen on CCTV at a Lowe's hardware store purchasing items including a shovel, axe, and gasoline cans, which investigators found suspicious for someone whose wife was missing.\n\n3. INTERROGATION (3)\n- [10:05 - 11:23] - Initial Interrogation - Hunter Tatum is interrogated by detectives, where he recounts his version of events, claiming the shooting was an accident during a struggle.\n- [12:09 - 12:47] - Emotional Breakdown - During interrogation, Hunter Tatum breaks down crying, expressing regret and distress over the incident.\n- [15:32 - 16:18] - Delivering Bad News - A detective informs Hunter Tatum that his wife, Summer, and their unborn baby have both died from the injuries. Hunter reacts with audible sobbing.\n\n4. BODYCAM FOOTAGE (8)\n- [04:50 - 05:14] - Police Arrival - Bodycam footage shows Prattville police officers arriving at the Tatum residence and approaching the front door where Hunter Tatum is on the phone with 911.\n- [05:10 - 05:25] - Suspect Detained - An officer enters the house and immediately commands Hunter Tatum to get on the ground, detaining him.\n- [05:25 - 05:37] - Victim Discovered - An officer moves through the house and discovers Summer Tatum on the bedroom floor with a gunshot wound to the head.\n- [05:41 - 06:06] - Medical Aid Rendered - Paramedics enter the home and begin rendering emergency medical aid to Summer Tatum on the living room floor.\n- [06:07 - 06:22] - Pregnancy Confirmed - While paramedics work on Summer, an officer asks Hunter if she is pregnant, which he confirms.\n- [07:18 - 07:31] - Crime Scene Search - An officer's bodycam shows the chaotic state of the master bedroom, which is in disarray.\n- [08:03 - 08:09] - Odd Discovery - An officer discovers an Xbox console and multiple video games submerged in the kitchen sink, indicating an unusual act of anger.\n- [15:01 - 15:18] - Suspect Transported - Hunter Tatum is escorted from the house in handcuffs and placed into a police vehicle for transport.\n\n5. INVESTIGATION (6)\n- [07:32 - 07:38] - Weapon Recovered - A crime scene photo shows the revolver used in the shooting, which was recovered from the dining room table.\n- [18:44 - 19:07] - Autopsy Findings - The Chief Deputy District Attorney explains the autopsy results, revealing that Summer was shot twice in the back of the head, contradicting Hunter's story of a face-to-face struggle.\n- [30:35 - 31:12] - Blood Evidence Found - In the Andre McDonald case, investigators find evidence of a violent struggle, including blood spatter on a bathroom door and light switch.\n- [31:12 - 31:32] - \"Kill Kit\" Found - Investigators detail the discovery of a shovel, axe, gasoline cans, and trash bags in Andre McDonald's vehicle, which they describe as items for disposing of a body.\n- [39:58 - 40:37] - Human Remains Discovered - Footage shows the rural field where a farmer discovered human remains underneath a cow skeleton, which were later identified as Andreen McDonald.\n- [40:51 - 41:33] - Forensic Report - An autopsy report on Andreen McDonald's remains shows evidence of blunt force trauma to her jaw, neck, and ribs, as well as signs that her body was burned.\n\nSUMMARY AND STORYLINE:\nThis episode of \"Killers Caught on Camera\" presents two separate murder cases where digital evidence was crucial in contradicting the suspects' stories and securing convictions.\n\nThe first case involves Hunter Tatum of Prattville, Alabama, who shot and killed his six-month-pregnant wife, Summer, on October 18, 2021. Hunter called 911 claiming the shooting was accidental, occurring during a struggle after Summer found out he was having an affair. However, police bodycam footage showed a chaotic scene, and audio from a neighbor's security camera captured the horrifying moments before the shooting, where Summer can be heard pleading for her life before two gunshots ring out. Forensic evidence later confirmed she was shot twice in the back of the head, disproving Hunter's self-defense claim. The combination of the audio evidence and the autopsy report led to Hunter Tatum being found guilty of capital murder for the deaths of both his wife and their unborn child.\n\nThe second case details the murder of Andreen McDonald by her husband, Air Force Major Andre McDonald, in San Antonio, Texas. Andreen was reported missing on March 1, 2019, after failing to show up for work. Andre claimed she had left after an argument, but his behavior was highly suspicious. Investigators discovered blood evidence in their home and a \"kill kit\" (including a shovel, axe, and gasoline) in his car. CCTV footage captured Andre purchasing these items, as well as a new handgun, and making a staged, brief inquiry at a local hospital. Although Andre tried to cover his tracks, his suspicious activities and incriminating internet searches about body disposal were all caught on camera or recovered from his phone. Andreen's burned and dismembered remains were found four months later. Andre McDonald was ultimately found guilty of manslaughter and tampering with evidence and was sentenced to 25 years in prison.\n[Notice] File saved to: /shared/1762192874386-dv0nnm.mp4\n\n",
    "videoUrl": "http://localhost:3001/shared/1762192874386-dv0nnm.mp4",
    "fileName": "Killer Cases Docu.mp4",
    "createdAt": 1762192877149,
    "date": "2025-11-03T18:01:17.149Z"
  },
  {
    "id": "1761907709803",
    "name": "case3",
    "analysisText": "[Notice] YouTube URL received. Processing...\n\n[Notice] Starting analysis...\n[Notice] Queued. Position: 1\nDownloading YouTube video…\nDownload complete.\nUploading video to Gemini File API…\nUpload complete. Waiting for Gemini to process the file…\nFile is ACTIVE. Starting analysis with Gemini 2.5 Pro…\n\nExcellent, I have analyzed the video and extracted the requested information. Here is the detailed breakdown:\n\n### **METADATA:**\n- **Date:** July 8th, 2017; July 5th, 2017; June 2019. Relative dates mentioned include Thursday, Sunday, and Monday of the previous week.\n- **Address/Location:** The victim's apartment.\n- **City/State/County:** Waynesville, Ohio; Warren County, Ohio.\n- **Police Department:** Waynesfield Police Department (PD), Warren County Sheriff's Office, BCI (Bureau of Criminal Investigation) Agent.\n\n### **TIMESTAMPS:**\n\n**1. 911 CALLS:**\n- [00:44 - 00:48] - 911 CALLS - The narrator states that a 911 call was received from a landlord requesting a welfare check on his tenant, Erin Mulcahy.\n\n**2. BODYCAM FOOTAGE:**\n- [00:00 - 00:03] - BODYCAM FOOTAGE - A landlord tells an officer that he believes his tenant, Erin Mulcahy, has been inside her apartment for two days.\n- [01:09 - 01:29] - BODYCAM FOOTAGE - An officer enters the apartment to perform a welfare check and discovers Erin's body in the bathroom with the shower still running.\n- [04:31 - 04:39] - BODYCAM FOOTAGE - The victim's ex-husband, Brent Williams, arrives at the crime scene in a red SUV.\n- [06:12 - 06:18] - BODYCAM FOOTAGE - Brent's father interrupts the police interview with Brent, telling him not to volunteer answers to questions.\n- [08:52 - 09:15] - BODYCAM FOOTAGE - During a follow-up interview, Brent's father becomes highly agitated and confrontational with officers.\n- [12:09 - 13:45] - BODYCAM FOOTAGE - Footage from a previous domestic dispute call shows a tense interaction between Erin and Brent, where Brent is seen leaving the residence.\n- [20:31 - 21:04] - BODYCAM FOOTAGE (Audio Recording) - An audio recording captures the moment of Brent Williams' arrest, where he protests his innocence and his parents shout in distress.\n\n**3. INTERROGATION:**\n- [01:58 - 02:28] - INTERROGATION - The landlord informs police that Brent and his father had visited Erin recently, establishing Brent as the last known person to have been at the house.\n- [03:23 - 04:06] - INTERROGATION - Brent's father is interviewed and states that he and Brent entered the apartment on Thursday because Brent needed to get his checks, and they heard the shower running.\n- [04:51 - 05:37] - INTERROGATION - Brent Williams is questioned at the scene. He states he last spoke to Erin on Sunday when he moved out and that it was not a heated argument.\n- [05:48 - 06:46] - INTERROGATION - An officer asks Brent for a voluntary DNA sample and to see his phone. Brent agrees, but his father interrupts, advising him not to cooperate, which raises suspicion.\n- [07:25 - 07:48] - INTERROGATION - A BCI agent interviews Erin's father, who reveals that she had a history of alcohol struggles, seizures, and mental health issues, including bipolar disorder and schizophrenia.\n- [14:39 - 15:23] - INTERROGATION - Police interview Curtis, the last person Erin called. He confirms Erin was upset about Brent and mentions she had recently met a man named Jimmy from a dating site.\n- [18:00 - 19:34] - INTERROGATION - Police interview Tiffany, a woman Brent was seeing. She reveals Brent told her his wife had recently died and that he was waiting on a $25,000 life insurance check. He also stated he \"knew she was going to die.\"\n\n**4. INVESTIGATION:**\n- [01:32 - 01:38] - INVESTIGATION - Police discover the body of Erin Mulcahy in the bathroom of her apartment, with the shower running and water flooding the floor.\n- [01:51 - 01:58] - INVESTIGATION - Erin's body is sent for an autopsy, and her phone is collected for forensic analysis.\n- [08:26 - 08:39] - INVESTIGATION (Key Breakthrough) - The autopsy report returns, revealing the cause of death was strangulation. The case officially becomes a homicide investigation.\n- [11:40 - 12:08] - INVESTIGATION - Detectives look into Brent Williams' past and discover a history of police calls to the couple's residence for domestic disputes.\n- [14:05 - 14:18] - INVESTIGATION (Key Breakthrough) - Analysis of Erin's phone records reveals the last outgoing call she made was on July 5th to a friend named Kurt (Curtis).\n- [16:08 - 16:32] - INVESTIGATION - Following a lead from Curtis, investigators identify a new person of interest, Jimmy, whom Erin had met online.\n- [20:08 - 20:23] - INVESTIGATION (Key Breakthrough) - DNA results from evidence found inside Erin's body are confirmed to be a match for Brent Williams, excluding the other suspect, Jimmy.\n- [20:24 - 20:31] - INVESTIGATION - With a motive from Tiffany's statement and conclusive DNA evidence, police move in to arrest Brent Williams.\n\n**5. INTERROGATION (Additional):**\n- [09:23 - 10:57] - INTERROGATION (Additional) - In a tense follow-up interview at Brent's parents' house, his father becomes irate, accusing the police of trying to frame his son and demanding they leave.\n- [16:33 - 17:13] - INTERROGATION (Additional) - Officers locate and question Jimmy, the man Erin met online. He is cooperative and provides an alibi.\n- [17:29 - 17:40] - INTERROGATION (Additional) - Armed with a warrant, detectives return to Brent's parents' house to seize his phone for evidence.\n\n### **SUMMARY AND STORYLINE:**\n- **The Overall Narrative:** The video documents the investigation into the murder of Erin Mulcahy. It begins as a routine welfare check requested by her landlord and quickly escalates into a complex homicide case. The investigation follows multiple leads, including the victim's estranged ex-husband, his defensive parents, and men the victim had recently been in contact with. Through police bodycam footage, interrogations, and interviews with investigators, the story unfolds, revealing a motive of financial gain and culminating in the identification and arrest of the killer.\n\n- **Key Events and Their Significance:**\n  - **Discovery of the Body (July 8, 2017):** Police find Erin Mulcahy deceased in her bathroom, launching the initial investigation.\n  - **Autopsy Results:** The medical examiner's finding that Erin was strangled transforms the case from an undetermined death to a homicide, intensifying the search for a suspect.\n  - **Tiffany's Statement:** A woman named Tiffany, who was seeing the main suspect Brent, comes forward. Her testimony that Brent knew his wife would die and was expecting a $25,000 life insurance payout provides a powerful motive for the murder.\n  - **DNA Evidence:** The conclusive DNA match linking Brent Williams to the victim's body serves as the undeniable physical evidence needed to secure an arrest and conviction.\n\n- **Timeline of Important Developments:**\n  1. **July 8, 2017:** A landlord calls 911 for a welfare check. Police discover Erin Mulcahy's body. The initial investigation begins, and suspicion falls on her ex-husband, Brent Williams.\n  2. **Investigation Widens:** Police interview Brent's defensive father, the victim's father, and uncover other potential suspects (Curtis and Jimmy) through the victim's phone records.\n  3. **Homicide Confirmed:** The autopsy report confirms strangulation, ruling out natural causes or accident.\n  4. **Motive Established:** A witness, Tiffany, reveals Brent's disturbing comments about his wife's death and a life insurance policy.\n  5. **Breakthrough:** DNA evidence from the crime scene definitively matches Brent Williams.\n  6. **Arrest and Conviction:** Brent is arrested. In June 2019, he is convicted of murder and sentenced to 15 years to life in prison.\n\n- **Main Characters:**\n  - **Erin Mulcahy:** The 35-year-old victim, described as a kind person struggling with mental health and alcohol issues.\n  - **Brent Williams:** Erin's ex-husband, who becomes the primary suspect. His inconsistent statements, location data, and a clear financial motive ultimately lead to his conviction.\n  - **Brent's Father:** A key figure whose confrontational and protective behavior towards his son raises significant suspicion among investigators.\n  - **Tiffany:** A crucial witness whose relationship with Brent leads her to provide the motive that cracks the case open.\n  - **Chief Nathan Motter & Detective Douglas Burke:** Lead investigators from the Waynesfield Police Department who guide the narrative through their interview commentary.\n\n- **Conclusion:** Through meticulous police work, including forensic analysis of phone records and DNA, and a critical tip from a witness, investigators were able to piece together the events leading to Erin's death. The evidence overwhelmingly pointed to her ex-husband, Brent Williams, who murdered her for financial gain from a life insurance policy. He was successfully prosecuted and is now serving a life sentence.\n",
    "videoUrl": "https://www.youtube.com/watch?v=CsdtnWC0OhE"
  },
  {
    "id": "1761905696412",
    "name": "case1",
    "analysisText": "[Notice] YouTube URL received. Processing...\n\n[Notice] Starting analysis...\n[Notice] Queued. Position: 1\nDownloading YouTube video…\nDownload complete.\nUploading video to Gemini File API…\nUpload complete. Waiting for Gemini to process the file…\nFile is ACTIVE. Starting analysis with Gemini 2.5 Pro…\n\nOf course. Here is a detailed analysis of the video with the requested information extracted and formatted.\n\n### METADATA:\n- **Date:** April 8th, 2022 (date of incident), 2023 (year of sentencing)\n- **Address/Location:** Bellview neighborhood\n- **City/State/County:** Pensacola, Escambia County, Florida\n- **Police Department:** Escambia County Sheriff's Office\n\n### TIMESTAMPS:\n\n**911 CALLS:**\n- [00:45 - 00:49] - 911 CALLS - The video narration mentions a \"chilling 911 call\" that brought deputies to the scene. The audio of the call is not played.\n- [11:41 - 11:53] - 911 CALLS - While in an interrogation room, the victim's husband, Aaron Ohlson, makes a desperate phone call to the hospital asking for his wife's status.\n- [11:53 - 12:08] - 911 CALLS - During a phone call with the hospital, Aaron Ohlson is informed that his wife, Adriana, has passed away, leading to a critical moment of extreme emotional breakdown.\n\n**CCTV FOOTAGE:**\n- Not Applicable.\n\n**INTERROGATION:**\n- [00:17 - 00:26] - INTERROGATION - Aaron Ohlson has a severe emotional breakdown in an interrogation room while on the phone, screaming \"What? No no no!\" upon hearing devastating news.\n- [00:27 - 00:37] - INTERROGATION - The victim's son, David Ohlson, exhibits bizarre and evasive behavior, laughing and singing \"la la la\" while his father is grieving in the same room.\n- [06:15 - 07:26] - INTERROGATION - In the interrogation room, David Ohlson is seen praying quietly while his father, Aaron, is on the phone trying to get an update on his wife's condition from the hospital.\n- [07:27 - 08:39] - INTERROGATION - A hospital chaplain calls and informs Aaron that his wife is in critical condition. Both father and son show significant emotional distress upon hearing the news.\n- [10:27 - 13:21] - INTERROGATION - David Ohlson begins his testimony, explaining his suicidal thoughts, his anger towards his mother's friend, Tatiani, and his plan to take a shotgun to confront her before changing his mind and returning home.\n- [13:21 - 13:42] - INTERROGATION - David makes a key statement, admitting he pointed the shotgun at his mother during an argument, then pointed it at himself, and claims it discharged when she grabbed it.\n- [14:42 - 17:01] - INTERROGATION - In a separate session, Aaron explains the family's recent troubles, including a pending divorce and his son's mental health struggles. He recounts buying the shotgun for home defense.\n- [17:01 - 17:19] - INTERROGATION - David makes a direct confession to his father, stating \"I killed her,\" which his father immediately tries to deny and silence.\n- [17:20 - 18:03] - INTERROGATION - Following his direct confession, David provides a detailed account of the shooting, admitting his actions and claiming it was his fault.\n- [18:03 - 19:16] - INTERROGATION - David has a complete emotional breakdown, expressing immense guilt and remorse. His father attempts to comfort him, and they embrace while sobbing.\n- [19:16 - 21:42] - INTERROGATION (Additional) - An investigator explains the next procedural steps to Aaron, informing him about the search warrant on the house and that his son will be booked into jail.\n\n**BODYCAM FOOTAGE:**\n- [00:00 - 00:10] - BODYCAM FOOTAGE - A man (Aaron Ohlson) is seen in extreme distress, talking to and comforting a younger man (David Ohlson) in the immediate aftermath of the incident.\n- [00:54 - 01:04] - BODYCAM FOOTAGE - Officers arrive at the chaotic crime scene, a residential home, where civilians are yelling for help.\n- [01:05 - 01:34] - BODYCAM FOOTAGE - EMS personnel and police officers are seen rendering aid to the female victim, Adriana Ohlson, and moving her onto a stretcher.\n- [03:48 - 04:07] - BODYCAM FOOTAGE - An officer performs a pat-down on both Aaron and David. Aaron informs the officer that he has a loaded 1911 pistol in the console of his truck.\n- [04:08 - 04:37] - BODYCAM FOOTAGE - David asks an officer a suspicious question about the survival rate of a \"buckshot to the chest,\" raising investigators' concerns.\n- [04:40 - 05:21] - BODYCAM FOOTAGE - Aaron confronts David, asking \"David man, what the heck dude?\" and states that the gun involved was meant for home defense, indicating he suspects his son's involvement.\n\n**INVESTIGATION:**\n- [01:05 - 01:18] - INVESTIGATION - First responders are on the scene, collecting the victim and preparing her for transport, marking the initial crime scene processing.\n- [02:57 - 03:14] - INVESTIGATION - The victim is formally identified as Adriana Ohlson by her husband, a crucial piece of information for the investigation.\n- [03:15 - 03:40] - INVESTIGATION - Detectives begin their on-scene questioning, starting with the son, David Ohlson.\n- [08:44 - 10:27] - INVESTIGATION - In the interrogation room, an investigator formally begins the interview with David and Aaron, clarifying that they are not under arrest at that moment and are free to leave.\n- [21:55 - 22:04] - INVESTIGATION - The outcome of the case is stated: David pleads no contest to manslaughter in 2023 and is sentenced to ten years in state prison.\n\n### SUMMARY AND STORYLINE:\n\n**Overall Narrative:**\nThe video documents the tragic investigation into the shooting of Adriana Ohlson, revealing a complex and dysfunctional family dynamic that culminates in her son, David Ohlson, confessing to the act. The story unfolds through police bodycam footage from the chaotic crime scene and intense interrogation room footage of the victim's husband, Aaron, and their 18-year-old son, David.\n\n**Timeline of Important Developments:**\nThe incident occurs on April 8, 2022, in Pensacola, Florida. Escambia County deputies respond to a 911 call at the Ohlson residence. They find Adriana Ohlson with a gunshot wound but still alive. Her husband, Aaron, and son, David, are present and highly emotional.\n\nAt the scene, David's suspicious question to an officer about survival rates from a \"buckshot to the chest,\" combined with his father confronting him on camera about a gun meant for \"home defense,\" immediately casts suspicion on him. Both are taken to the station for questioning.\n\nIn the interrogation room, the narrative takes a harrowing turn. Aaron receives a phone call from the hospital chaplain informing him his wife has died, causing him to break down completely. In a chilling juxtaposition, David exhibits bizarre, detached behavior. However, as the interrogation proceeds, David confesses. He details his anger over his parents' pending divorce and his mother's emotional coldness, which he blames on her friends. He admits to taking a shotgun with the initial intent of confronting his mother's best friend but returned home instead.\n\nDavid claims that during an argument, he pointed the shotgun at his mother, then at himself, and it accidentally discharged when she grabbed it. This narrative shatters when his father tells him, \"David, she's gone,\" to which David replies, \"I killed her,\" confessing directly. He breaks down, admitting it was his fault.\n\n**Main Characters:**\n- **Adriana Ohlson:** The victim of the shooting.\n- **Aaron Ohlson:** The victim's husband, whose grief turns to horror as he learns his own son is responsible for his wife's death.\n- **David Ohlson:** The 18-year-old son and perpetrator, who confesses to the shooting amidst a severe emotional and psychological crisis.\n\n**Conclusion:**\nDavid Ohlson, who had a history of severe mental health issues, pleaded no contest to manslaughter in 2023. He was sentenced to ten years in state prison, followed by community control and probation. The case ends by exposing the shocking dysfunction within the Ohlson family that led to an unthinkable act of matricide.\n",
    "videoUrl": "https://www.youtube.com/watch?v=u4OwISGOvwI"
  }
]