[
  {
    "id": "1761894040251",
    "name": "case2",
    "analysisText": "\n[Notice] Starting analysis...\n[Notice] Queued. Position: 1\nUploading video to Gemini File API…\nUpload complete. Waiting for Gemini to process the file…\nFile is ACTIVE. Starting analysis with Gemini 2.5 Pro…\n\nMETADATA:\n- Date: 2021-10-18, 2021-10-19, July 2019, May 2021, Feb 2022, 2019-Mar-01, March 2nd, July 11th, July 13th 2019, June 2023\n- Address/Location: Baptist Medical Center South (2105 East South Blvd.), Baptist Neighborhood Hospital, Elizondo Tower, Autauga County Courthouse, Nagel's Gun Shop, Lowe's\n- City/State/County: Prattville, Autauga County, Alabama; Montgomery, Alabama; San Antonio, Bexar County, Texas; Portland, Jamaica\n- Police Department: Autauga 911, Prattville Police Department, Bexar County Sheriff's Office, Bexar County District Attorney's Office\n\nTIMESTAMPS:\n[00:11 - 00:15] - 911 CALLS - 911 Call (00:11 - 00:15) - A portion of Hunter Tatum's 911 call is played where he says, \"she pulled a gun on me and then...\"\n[00:28 - 00:31] - CCTV FOOTAGE - CCTV Footage (00:28 - 00:31) - Andre McDonald is seen at a Lowe's checkout counter purchasing items.\n[00:37 - 00:38] - CCTV FOOTAGE - CCTV Footage (00:37 - 00:38) - Andre McDonald is seen leaving the Lowe's store with a shopping cart.\n[03:55 - 04:32] - 911 CALLS - 911 Call (03:55 - 04:32) - Hunter Tatum calls Autauga 911, audibly distressed, and confesses to shooting his wife after a struggle for a gun.\n[04:37 - 04:47] - BODYCAM FOOTAGE - BODYCAM Footage (04:37 - 04:47) - Police dashcam shows officers responding to the scene of the shooting.\n[04:50 - 05:27] - BODYCAM FOOTAGE - BODYCAM Footage (04:50 - 05:27) - Officers arrive on scene, order Hunter Tatum out, and enter the home to find the victim, Summer Tatum.\n[05:27 - 05:40] - BODYCAM FOOTAGE - BODYCAM Footage (05:27 - 05:40) - An officer tends to Summer Tatum in the bedroom, asking where she is shot.\n[06:03 - 06:23] - BODYCAM FOOTAGE - BODYCAM Footage (06:03 - 06:23) - Medics and police are in the house, an officer states the victim is pregnant and confirms the husband shot her.\n[07:29 - 07:58] - CCTV FOOTAGE - CCTV Footage (07:29 - 07:58) - Audio from a neighbor's security camera captures screaming and two gunshots, contradicting the suspect's story.\n[08:12 - 08:35] - BODYCAM FOOTAGE - BODYCAM Footage (08:12 - 08:35) - Police officers are seen escorting Hunter Tatum in handcuffs to a patrol car.\n[08:40 - 09:14] - INTERROGATION - Interrogation (08:40 - 09:14) - Initial interrogation with Hunter Tatum where he claims his wife was suicidal and the gun went off during a struggle.\n[15:02 - 15:52] - INTERROGATION (Additional) - Interrogation (Additional) (15:02 - 15:52) - In a follow-up interrogation, Detective Wesley Clark informs Hunter Tatum that both his wife and unborn baby have died, prompting a strong emotional reaction from Tatum.\n[19:40 - 19:53] - CCTV FOOTAGE - CCTV Footage (19:40 - 19:53) - Footage from the Tatum's home security camera shows the moments leading up to the shooting, capturing a conversation and then Summer leaving the room.\n[19:57 - 20:21] - 911 CALLS - 911 Call (19:57 - 20:21) - Replay of Hunter Tatum's 911 call where he claims his wife pulled the gun and he shot her during a struggle.\n[20:54 - 21:46] - CCTV FOOTAGE - CCTV Footage (20:54 - 21:46) - Audio from the neighbor's security camera captures Summer Tatum screaming \"No!\", \"Please, no!\", and \"Help me!\" followed by two gunshots.\n[27:23 - 27:25] - CCTV FOOTAGE - CCTV Footage (27:23 - 27:25) - Andre McDonald is seen in a hospital waiting room.\n[32:12 - 32:43] - CCTV FOOTAGE - CCTV Footage (32:12 - 32:43) - Surveillance footage shows Andre McDonald at a hospital reception, asking about a patient, then abruptly leaving.\n[34:11 - 34:40] - CCTV FOOTAGE - CCTV Footage (34:11 - 34:40) - Undercover officers follow and arrest Andre McDonald in a parking lot.\n[36:37 - 36:54] - CCTV FOOTAGE - CCTV Footage (36:37 - 36:54) - Andre McDonald is seen at Lowe's purchasing a shovel, axe, gas cans, and other items.\n\nSUMMARY AND STORYLINE:\nThis video from \"Killers Caught on Camera\" presents two separate murder cases where camera footage was crucial to the investigation.\n\n**Case 1: Prattville, Alabama**\nThe first story focuses on the murder of Summer Tatum, who was six months pregnant, by her husband, Hunter Tatum, on October 18, 2021. The incident begins with a frantic 911 call from Hunter, who claims his wife discovered his online affair, became suicidal, and was accidentally shot during a struggle over the gun.\n\nBodycam footage shows police arriving at a chaotic scene, with evidence suggesting Summer was in the process of leaving Hunter. While Summer was rushed to the hospital, she and her unborn baby tragically died. Initially, Hunter's story seemed plausible, but a key piece of evidence from a neighbor's security camera changed the entire investigation. The camera's audio captured Summer's desperate pleas for her life, screaming \"Please, no!\" and \"Help me!\", followed by two distinct gunshots. This directly contradicted Hunter's claim of an accidental shooting during a struggle.\n\nDuring interrogation, Hunter stuck to his story but was later informed of the deaths of his wife and child, leading to an emotional breakdown. At trial, the prosecution used the damning audio evidence to prove premeditation. Hunter Tatum was found guilty of the capital murder of his wife and unborn son and sentenced to a total of 198 years in prison.\n\n**Case 2: San Antonio, Texas**\nThe second case involves the murder of Andreen McDonald by her husband, Andre McDonald, an Air Force Major. Andreen was reported missing on March 1, 2019, after failing to show up for work. Andre claimed they had an argument and she left. However, police found signs of a struggle and blood in their home, making Andre a person of interest.\n\nUndercover surveillance captured Andre behaving suspiciously. CCTV footage showed him purchasing a shovel, axe, gasoline, trash bags, and a new gun. Another camera caught him inquiring at a hospital if a patient with his wife's name had been admitted, only to leave before getting an answer. This \"guilty behavior\" led to his arrest.\n\nFour months later, Andreen's remains were discovered on a remote ranch. An autopsy revealed she died from blunt force trauma to the head and neck, and there was evidence that her body had been burned. Police matched a hammer found at the couple's home to the injuries. Investigators discovered the motive was financial; Andre had learned that Andreen had started a new business without his knowledge. At trial, Andre McDonald was acquitted of murder but found guilty of the lesser charge of manslaughter and tampering with evidence, receiving a sentence of 25 years.\n",
    "videoUrl": "/shared/1761894039080-8o4xx5.mp4",
    "fileName": "Killer Cases Docu.mp4"
  },
  {
    "id": "1761892566746",
    "name": "case1",
    "analysisText": "\n[Notice] Starting analysis...\n[Notice] Queued. Position: 1\nDownloading YouTube video…\nDownload complete.\nUploading video to Gemini File API…\nUpload complete. Waiting for Gemini to process the file…\nFile is ACTIVE. Starting analysis with Gemini 2.5 Pro…\n\nMETADATA:\n- Date: April 8th, 2022; 2023 (mentioned for sentencing)\n- Address/Location: Bellview neighborhood\n- City/State/County: Pensacola, Florida; Escambia County\n- Police Department: Escambia County Sheriff's Office\n\nTIMESTAMPS:\n[00:18 - 00:26] - 911 CALLS - The victim's husband, Aaron Ohlson, receives a devastating phone call while in an interrogation room and has a severe emotional breakdown, screaming \"No, no, no... what?\".\n[00:32 - 00:37] - INTERROGATION - The victim's son, David Ohlson, is shown in an interrogation room behaving erratically and singing.\n[00:41 - 01:05] - BODYCAM FOOTAGE - Bodycam footage shows police arriving at a chaotic crime scene at night in a residential neighborhood.\n[01:05 - 01:35] - BODYCAM FOOTAGE - Police and paramedics attend to the female victim who has been shot. She is being prepared for transport to the hospital.\n[01:35 - 01:46] - BODYCAM FOOTAGE - An officer notes that the victim is still conscious and may be able to answer questions.\n[01:47 - 02:16] - INVESTIGATION - Officers at the scene discuss the situation, identifying the husband and son as onlookers and describing how the victim was found.\n[02:16 - 02:51] - INVESTIGATION - An officer interviews the husband, Aaron, at the scene, who is distraught and asking for updates on his wife's condition.\n[02:57 - 03:06] - INVESTIGATION - The victim is identified as Adriana Ohlson.\n[03:14 - 03:21] - INVESTIGATION - The husband and son are identified as Aaron Olsen and David Olsen.\n[03:21 - 03:40] - INVESTIGATION - An officer interviews the son, David, who appears distraught and unsure of where his wallet is.\n[03:49 - 04:07] - BODYCAM FOOTAGE - An officer conducts a pat-down on both the father and son. The father, Aaron, informs the officer he has a loaded 1911 pistol in the console of his truck.\n[04:21 - 04:37] - INTERROGATION - The son, David, asks a bizarre and suspicious question to an officer: \"How many people survive a bug shot to the chest?\"\n[04:46 - 05:22] - BODYCAM FOOTAGE - In a crucial exchange at the crime scene, Aaron confronts his son David, stating, \"That was for home defense,\" followed by \"David man, what the heck dude?\".\n[06:16 - 06:42] - INTERROGATION - While waiting in the interrogation room, David begins praying before breaking into bizarre singing. His father, Aaron, is also present.\n[07:08 - 07:26] - INTERROGATION (Additional) - David makes his first admission, stating \"It's my fault. It's my fault\" after his father again says the gun was for \"home defense.\"\n[07:31 - 07:49] - 911 CALLS - Aaron calls the hospital for an update and is told his wife, Adriana, is still alive and being attended to by doctors.\n[07:58 - 08:23] - INTERROGATION - In the interrogation room, Aaron gets an update that his wife is in critical condition.\n[08:58 - 10:17] - INTERROGATION - Aaron gives his testimony, describing his troubled marriage, his son's mental health issues, and the events of the night, culminating in him walking in to find his son with a shotgun and then hearing the shot.\n[10:17 - 11:23] - INTERROGATION (Additional) - David begins his confession, claiming he was planning to kill his mother's friend, Tatiana. He describes getting the shotgun, his mother confronting him, him pointing the gun at himself, and then pointing it at her before it went off.\n[11:32 - 12:01] - 911 CALLS - In the most critical moment of the interrogation, Aaron receives the phone call informing him that his wife did not survive. He collapses in grief.\n[12:56 - 13:07] - INTERROGATION (Additional) - Aaron confronts his son, David, telling him his mother is gone. David screams and confesses, \"I killed her!\"\n[13:07 - 13:42] - INTERROGATION (Additional) - In an emotional outburst, David screams, \"I didn't have the life you had dad, you didn't kill anybody, I did... Whatever prison I go to, I f**king deserve it.\"\n[13:42 - 14:41] - INTERROGATION - The interrogation continues with David explaining his actions. He admits he was planning to kill his mother's best friend but hesitated, then pointed the gun at himself, and finally at his mother.\n\nSUMMARY AND STORYLINE:\n- **Overall Narrative:** The video documents the tragic events of April 8, 2022, in Pensacola, Florida, where 18-year-old David Ohlson shot and killed his mother, Adriana Ohlson. It combines police bodycam footage from the immediate aftermath with intense interrogation room footage of both David and his father, Aaron Ohlson, as they grapple with the horror of the situation and the truth is slowly revealed.\n\n- **Key Events and Timeline:**\n  1.  **Police Arrival:** Escambia County deputies respond to a chaotic shooting scene at the Ohlson residence. They find Adriana Ohlson with a gunshot wound and she is rushed to the hospital in critical condition.\n  2.  **Initial Interactions:** Her husband, Aaron, and son, David, are present at the scene, both appearing extremely distraught. Police separate them for questioning.\n  3.  **Interrogation Begins:** Both Aaron and David are brought to the station. David exhibits bizarre behavior, while Aaron provides background on their strained family life, including an impending divorce and David's history of mental health issues.\n  4.  **The Devastating News:** While in the interrogation room, Aaron receives a phone call from the hospital informing him that his wife, Adriana, has died. His reaction is one of complete devastation and disbelief.\n  5.  **The Confession:** When Aaron informs David of his mother's death, David breaks down completely and screams, \"I killed her!\" He later confesses to the detectives that he had taken a shotgun with the intent to kill his mother's best friend, whom he blamed for his family's problems. He claims that when his mother confronted him, he first pointed the gun at himself, then at her, and it discharged.\n  6.  **Emotional Aftermath:** The father and son share a raw, emotional moment in the interrogation room, with the father trying to comfort his son while processing his own immense grief and the reality of what his son has done.\n\n- **Main Characters:**\n  - **David Ohlson:** The 18-year-old son and shooter.\n  - **Aaron Ohlson:** The victim's husband and David's father.\n  - **Adriana Ohlson:** The victim of the shooting.\n\n- **Conclusion:** Due to his severe mental health history, an insanity plea was considered. However, in 2023, David Ohlson pleaded no contest to manslaughter. He received a sentence of ten years in state prison, followed by community control, which includes strict house arrest and probation. The case concludes as a profound family tragedy, leaving a father to mourn the loss of his wife at the hands of their son.\n",
    "videoUrl": "https://www.youtube.com/watch?v=u4OwISGOvwI"
  }
]